01 EMPLOYEE-RECORD.
       02 EMPLOYEE-NAME.
           05 FIRST    PICTURE IS X(20).
           05 MIDDLE   PICTURE IS X(20).
           05 LAST     PICTURE IS X(20).
       02 HOURLY-RATE  PICTURE IS 99V99.
